README.md
```mermaid
graph LR
  Customer -->|"LIVES_IN · 004"| State
  Customer -->|"PLACED · 006"| Order
  Order -->|"CONTAINS {qty, price} · 006"| Product
  Customer -->|"WROTE · 003"| Review
  Review  -->|"REVIEWS · 003"| Product
  Customer -->|"WANTS {addedAt} · 005"| Product
  Customer -->|"RATED {stars} · 009"| Product
  Product -->|"SUPPLIED_BY · 004"| Vendor
  Product -->|"IN_CATEGORY · 007"| Category
  Category -->|"SUBCATEGORY_OF · 007"| Category
  Product -->|"ALSO_BOUGHT {weight} · 012"| Product
  Order -->|"HAS_STATUS · 010"| OrderStatus
  OrderStatus -->|"NEXT · 010"| OrderStatus
  Order -->|"CURRENT_STATUS · 010"| OrderStatus
  Order -->|"ORDERED_ON · 010"| Day
  Year -->|"HAS_MONTH · 010"| Month
  Month -->|"HAS_DAY · 010"| Day
```
